# GetViewRange Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewPlan..::..GetViewRange Method
ViewPlan Class See Also
---
Gets the view range.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PlanViewRange GetViewRange()
```

Visual Basic
---
```text
Public Function GetViewRange As PlanViewRange
```

Visual C++
---
```text
public:
PlanViewRange^ GetViewRange()
```

# ### Return Value
The view range.
# See Also
ViewPlan Class
Autodesk.Revit.DB Namespace